{"format": "layers-model", "generatedBy": "keras v2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.19.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model1", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5776], "dtype": "float32", "sparse": false, "ragged": false, "name": "input1"}, "name": "input1", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape_Reshape1", "trainable": true, "dtype": "float32", "target_shape": [19, 19, 16]}, "name": "reshape_Reshape1", "inbound_nodes": [[["input1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D1", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2, "mode": "fan_in", "distribution": "uniform", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D1", "inbound_nodes": [[["reshape_Reshape1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D2", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2, "mode": "fan_in", "distribution": "uniform", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D2", "inbound_nodes": [[["conv2d_Conv2D1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D3", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2, "mode": "fan_in", "distribution": "uniform", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D3", "inbound_nodes": [[["conv2d_Conv2D2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D4", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2, "mode": "fan_in", "distribution": "uniform", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D4", "inbound_nodes": [[["conv2d_Conv2D3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D5", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2, "mode": "fan_in", "distribution": "uniform", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D5", "inbound_nodes": [[["conv2d_Conv2D4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D6", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2, "mode": "fan_in", "distribution": "uniform", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D6", "inbound_nodes": [[["conv2d_Conv2D5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D7", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2, "mode": "fan_in", "distribution": "uniform", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D7", "inbound_nodes": [[["conv2d_Conv2D6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D8", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2, "mode": "fan_in", "distribution": "uniform", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D8", "inbound_nodes": [[["conv2d_Conv2D7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D9", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2, "mode": "fan_in", "distribution": "uniform", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D9", "inbound_nodes": [[["conv2d_Conv2D8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D10", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2, "mode": "fan_in", "distribution": "uniform", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D10", "inbound_nodes": [[["conv2d_Conv2D9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_Conv2D11", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2, "mode": "fan_in", "distribution": "uniform", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_Conv2D11", "inbound_nodes": [[["conv2d_Conv2D10", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_Flatten1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_Flatten1", "inbound_nodes": [[["conv2d_Conv2D11", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_Dense1", "trainable": true, "dtype": "float32", "units": 361, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2, "mode": "fan_in", "distribution": "uniform", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_Dense1", "inbound_nodes": [[["flatten_Flatten1", 0, 0, {}]]]}], "input_layers": [["input1", 0, 0]], "output_layers": [["dense_Dense1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "conv2d_Conv2D1/kernel", "shape": [7, 7, 16, 96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.0895169307203856, "scale": 0.008070495783113966, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D1/bias", "shape": [96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07367398014255598, "scale": 0.00044116155773985617, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D10/kernel", "shape": [3, 3, 96, 96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.49597784818387497, "scale": 0.003620276264115876, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D10/bias", "shape": [96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4650657258781732, "scale": 0.002657518433589561, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D11/kernel", "shape": [3, 3, 96, 96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5895706625545726, "scale": 0.004094240712184532, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D11/bias", "shape": [96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13247220901881945, "scale": 0.0013381031214022168, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D2/kernel", "shape": [5, 5, 96, 96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8573541807193381, "scale": 0.006544688402437696, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D2/bias", "shape": [96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16565673608405918, "scale": 0.0018613116413939233, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D3/kernel", "shape": [5, 5, 96, 96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5681826647590188, "scale": 0.004404516781077665, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D3/bias", "shape": [96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.25455895475312773, "scale": 0.001743554484610464, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D4/kernel", "shape": [5, 5, 96, 96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5842399139030306, "scale": 0.004359999357485303, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D4/bias", "shape": [96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21979110731798057, "scale": 0.0014089173546024396, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D5/kernel", "shape": [5, 5, 96, 96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4803994911558488, "scale": 0.0035585147493025836, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D5/bias", "shape": [96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.27461441121265, "scale": 0.0015341587218583798, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D6/kernel", "shape": [3, 3, 96, 96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.48920447861447053, "scale": 0.0034210103399613325, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D6/bias", "shape": [96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2671713570753734, "scale": 0.0014211242397626242, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D7/kernel", "shape": [3, 3, 96, 96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.467592583918104, "scale": 0.0034894968949112236, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D7/bias", "shape": [96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.24938444349111297, "scale": 0.0014415285750931386, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D8/kernel", "shape": [3, 3, 96, 96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5838292231746749, "scale": 0.003791098851783603, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D8/bias", "shape": [96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.31913932678746243, "scale": 0.0017535127845464968, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D9/kernel", "shape": [3, 3, 96, 96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5304184979083492, "scale": 0.003815960416606828, "original_dtype": "float32"}}, {"name": "conv2d_Conv2D9/bias", "shape": [96], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3694610490518458, "scale": 0.0020525613836213656, "original_dtype": "float32"}}, {"name": "dense_Dense1/kernel", "shape": [34656, 361], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.7501362947856682, "scale": 0.018293347779442283, "original_dtype": "float32"}}, {"name": "dense_Dense1/bias", "shape": [361], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9255713686054827, "scale": 0.0050030884789485554, "original_dtype": "float32"}}]}]}